tap "FelixKratz/formulae"
tap "homebrew/bundle"
tap "homebrew/linux-fonts"
tap "homebrew/services"
tap "localsend/localsend"
tap "microsoft/git"
tap "arl/arl"

brew "bash"
brew "bottom"
brew "cmake"
brew "coreutils"

brew "exiftool"
brew "gnupg"
brew "gnutls"
brew "go"
brew "mas"
brew "php@8.1"
brew "procs"
brew "speedtest-cli"

cask_args appdir: "~/Applications", require_sha: true

cask "alacritty"
cask "bluesnooze"
cask "firefox"
cask "font-caskaydia-cove-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "keepingyouawake"
cask "localsend"
cask "moonlight"
cask "openscad-snapshot"
cask "podman-desktop"
cask "powershell"
cask "rectangle"
cask "scroll-reverser"
cask "slack"
cask "spotify"
cask "steam"
cask "tailscale"
cask "tidal"
cask "utm"
cask "vlc"
