# vim: set ft=ruby:

tap "FelixKratz/formulae"
tap "arl/arl"
tap "localsend/localsend"
tap "microsoft/git"
tap "oven-sh/bun"
tap "utkuozdemir/pv-migrate"

brew "age"
brew "argocd"
brew "aws-vault"
brew "awscli"
brew "bash"
brew "bat"
brew "bluesnooze"
brew "bottom"
brew "btop"
brew "bun"
brew "charmbracelet/tap/crush"
brew "chezmoi"
brew "cmake"
brew "cmatrix"
brew "cookcli"
brew "coreutils"
brew "cowsay"
brew "crane"
brew "curl"
brew "difftastic"
brew "direnv"
brew "docker-compose"
brew "docker-credential-helper"
brew "dotnet"
brew "duf"
brew "entr"
brew "exiftool"
brew "eza"
brew "fastfetch"
brew "figlet"
brew "fx"
brew "fzf"
brew "gd"
brew "gemini-cli"
brew "gh"
brew "git"
brew "git-delta"
brew "git-extras"
brew "git-lfs"
brew "gitmux"
brew "glow"
brew "gnupg"
brew "gnutls"
brew "go"
brew "go-task"
brew "gum"
brew "helm"
brew "htop"
brew "httpie"
brew "hugo"
brew "hurl"
brew "jq"
brew "just"
brew "k9s"
brew "kubectl-cnpg"
brew "kubernetes-cli"
brew "kubeseal"
brew "kustomize"
brew "lazydocker"
brew "lazygit"
brew "litecli"
brew "llm"
brew "lolcat"
brew "mariadb"
brew "marp-cli"
brew "mas"
brew "minijinja-cli"
brew "mycli"
brew "ncdu"
brew "neovim"
brew "nmap"
brew "node@20"
brew "node@22", { link: true, overwrite: true }
brew "noti"
brew "nyancat"
brew "ollama", { restart_service: :changed, start_service: true } unless OS.mac?
brew "openssh"
brew "ouch"
brew "pgcli"
brew "php@8.1", { link: true }
brew "pipx"
brew "podman"
brew "prettyping"
brew "procs"
brew "pv"
brew "pv-migrate"
brew "ripgrep"
brew "sesh"
brew "sops"
brew "speedtest-cli"
brew "spotify_player"
brew "starship"
brew "syncthing", { restart_service: :changed, start_service: true }
brew "talhelper"
brew "talosctl"
brew "tig"
brew "tldr"
brew "tmux"
brew "tmuxinator"
brew "topgrade"
brew "tree"
brew "tty-clock"
brew "virtctl"
brew "watch"
brew "wego"
brew "wget"
brew "yq"
brew "zoxide"
brew "zsh"

cask_args appdir: "~/Applications", require_sha: true

cask "aws-vpn-client"
cask "bitwarden"
cask "firefox"
cask "jellyfin-media-player"
cask "keepingyouawake"
cask "multiviewer-for-f1"
cask "obsidian"
cask "ollama-app"
cask "openscad@snapshot"
cask "podman-desktop"
cask "powershell"
cask "rectangle"
cask "rustdesk"
cask "scroll-reverser"
cask "signal"
cask "slack"
cask "spotify"
cask "tidal"
cask "utm"
cask "vlc"
cask "wezterm"
