tap "FelixKratz/formulae"
tap "homebrew/bundle"
tap "homebrew/linux-fonts"
tap "homebrew/services"
tap "localsend/localsend"
tap "microsoft/git"
tap "arl/arl"
tap "utkuozdemir/pv-migrate"

brew "aws-vault"
brew "awscli"
brew "bash"
brew "bat"
brew "bottom"
brew "chezmoi"
brew "cmake"
brew "cmatrix"
brew "coreutils"
brew "cowsay"
brew "curl"
brew "difftastic"
brew "direnv"
brew "docker-compose"
brew "duf"
brew "entr"
brew "exiftool"
brew "eza"
brew "fastfetch"
brew "figlet"
brew "fzf"
brew "gd"
brew "gh"
brew "git"
brew "git-delta"
brew "git-extras"
brew "gitmux"
brew "glow"
brew "gnupg"
brew "gnutls"
brew "go"
brew "go-task"
brew "htop"
brew "httpie"
brew "hurl"
brew "jq"
brew "just"
brew "k9s"
brew "kubernetes-cli"
brew "kubeseal"
brew "kustomize"
brew "lazygit"
brew "litecli"
brew "lolcat"
brew "mariadb"
brew "mas"
brew "minijinja-cli"
brew "mycli"
brew "ncdu"
brew "neovim"
brew "node@20"
brew "node@22", link: true
brew "noti"
brew "nyancat"
brew "ollama", restart_service: :changed, start_service: true
brew "openssh"
brew "pgcli"
brew "php@8.1"
brew "podman"
brew "prettyping"
brew "procs"
brew "pv"
brew "pv-migrate"
brew "ripgrep"
brew "speedtest-cli"
brew "starship"
brew "syncthing", restart_service: :changed, start_service: true
brew "tig"
brew "tldr"
brew "tmux"
brew "tree"
brew "tty-clock"
brew "yq"
brew "zoxide"

cask_args appdir: "~/Applications", require_sha: true

cask "bluesnooze"
cask "firefox"
cask "font-caskaydia-cove-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "keepingyouawake"
cask "localsend"
cask "moonlight"
cask "openscad"
cask "podman-desktop"
cask "powershell"
cask "rectangle"
cask "scroll-reverser"
cask "signal"
cask "slack"
cask "steam"
cask "tailscale"
cask "tidal"
cask "utm"
cask "vlc"
cask "wezterm"
