# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-versions"

# Development Tools
brew "ansible"
brew "autojump"
brew "aws-vault"
brew "awscli"
brew "bash"
brew "bat"
brew "cmatrix"
brew "coreutils"
brew "curl"
brew "duf"
brew "entr"
brew "exa"
brew "exiftool"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "htop"
brew "httpie"
brew "jq"
brew "just"
brew "lazygit"
brew "make"
brew "mas"
brew "mosh"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "noti"
brew "nvm"
brew "openssh"
brew "php@8.1"
brew "podman"
brew "prettyping"
brew "pv"
brew "python@3.9"
brew "rcm"
brew "ripgrep"
brew "tig"
brew "tldr"
brew "tmux"
brew "tree"
brew "vim"
brew "watch"
brew "watchexec"
brew "watchman"
brew "wget"
brew "zsh"

# DB CLI
brew "athenacli"
brew "iredis"
brew "litecli"
brew "mycli"
brew "pgcli"

# Casks
cask "aws-vpn-client"
cask "bluesnooze"
cask "discord"
cask "docker"
cask "element"
cask "figma"
cask "firefox"
cask "inkscape"
cask "insomnia"
cask "keepingyouawake"
cask "kitty"
cask "lastpass"
cask "notion"
cask "onlyoffice"
cask "openscad"
cask "pocket-casts"
cask "podman-desktop"
cask "postman"
cask "powershell"
cask "qutebrowser"
cask "rectangle"
cask "scroll-reverser"
cask "slack"
cask "spotify"
cask "steam"
cask "tailscale"
cask "telegram"
cask "thunderbird-beta"
cask "todoist"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "xquartz"
cask "zoom"

# MAS
mas "Bitwarden", id: 1352778147
mas "ToothFairy", id: 1191449274
