# vim: set ft=ruby:
cask_args appdir: "~/Applications", require_sha: true
ENV["PATH"] = "#{HOMEBREW_PREFIX}/bin:#{ENV["PATH"]}"

brew "atlassian/homebrew-acli/acli"
brew "aws-vault"
brew "awscli"
brew "docker-compose"
brew "docker-credential-helper"
brew "hashicorp/tap/terraform"
brew "m-cli"
brew "mas"
brew "octopusdeploy/taps/octopus-cli"
brew "php-cs-fixer"
brew "phpstan"

cask "aws-vpn-client"
cask "bitwarden"
cask "bluesnooze"
cask "claude"
cask "claude-code"
cask "cloudflare-warp"
cask "firefox"
cask "hiddenbar"
cask "keepingyouawake"
cask "localsend"
cask "multiviewer"
cask "obsidian"
cask "openscad"
cask "podman-desktop"
cask "powershell"
cask "scroll-reverser"
cask "signal"
cask "slack"
cask "spotify"
cask "tailscale-app"
cask "vlc"
cask "wezterm"
cask "handy"
cask "snowflakedb/snowflake-cli/snowflake-cli"
cask "steam"
cask "todoist-app"
