# vim: set ft=ruby:
cask_args appdir: "~/Applications", require_sha: true
ENV["PATH"] = "#{HOMEBREW_PREFIX}/bin:#{ENV["PATH"]}"

# runtimes
brew "bash"
brew "fish"

# package managers
brew "antidote"
brew "fisher"
brew "pipx"
brew "uv"
npm "yarn"

# lsp
brew "ansible-language-server"
brew "bash-language-server"
brew "dockerfile-language-server"
brew "fish-lsp"
brew "lua-language-server"
brew "sql-language-server"
brew "typescript-language-server"
brew "yaml-language-server"
npm "intelephense"
npm "marksman"
npm "vscode-langservers-extracted"

# lint & format
brew "ansible-lint"
brew "shellcheck"
brew "sqlfluff"
brew "stylua"
brew "taplo"
brew "yamlfmt"
brew "yamllint"
npm "@fsouza/prettierd"
npm "eslint_d"
npm "stylelint"
npm "golangci-lint"

# ...but better
brew "bat"
brew "duf"
brew "entr"
brew "eza"
brew "htop"
brew "ncdu"
brew "prettyping"

# tuis
brew "lazygit"
brew "litecli"
brew "mycli"
brew "pgcli"

# neovim
npm "neovim"
brew "neovim"
brew "utftex"

# AI
brew "opencode"
npm "tilth"
uv "cocoindex-code[full]"
brew "ast-grep"
brew "ollama"

# other
brew "ansible"
brew "arl/arl/gitmux"
brew "bottom"
brew "cmake"
brew "cmatrix"
brew "coreutils"
brew "cowsay"
brew "crane"
brew "curl"
brew "difftastic"
brew "direnv"
brew "exiftool"
brew "fastfetch"
brew "figlet"
brew "fx"
brew "fzf"
brew "gd"
brew "gh"
brew "git"
brew "git-delta"
brew "git-extras"
brew "git-lfs"
brew "glow"
brew "gnupg"
brew "gnutls"
brew "jq"
brew "just"
brew "lolcat"
brew "mariadb"
brew "nmap"
brew "noti"
brew "nyancat"
brew "openssh"
brew "podman"
brew "pre-commit"
brew "procs"
brew "pv"
brew "qrencode"
brew "rbw"
brew "ripgrep"
brew "sesh"
brew "starship"
brew "stow"
brew "syncthing"
brew "tlrc"
brew "tmux"
brew "tmuxp"
brew "topgrade"
brew "tree-sitter-cli"
brew "watch"
brew "wget"
brew "yq"
brew "zoxide"
cask "font-fira-code-nerd-font"

# Apps
flatpak "com.bitwarden.desktop"
flatpak "com.github.tchx84.Flatseal"
flatpak "com.rustdesk.RustDesk"
flatpak "com.spotify.Client"
flatpak "com.todoist.Todoist"
flatpak "com.usebottles.bottles"
flatpak "com.valvesoftware.Steam"
flatpak "io.missioncenter.MissionCenter"
flatpak "io.podman_desktop.PodmanDesktop"
flatpak "it.mijorus.smile"
flatpak "md.obsidian.Obsidian"
flatpak "net.davidotek.pupgui2"
flatpak "org.jellyfin.JellyfinDesktop"
flatpak "org.kde.gwenview"
flatpak "org.kde.isoimagewriter"
flatpak "org.libreoffice.LibreOffice"
flatpak "org.localsend.localsend_app"
flatpak "org.mozilla.firefox"
flatpak "org.openscad.OpenSCAD"
flatpak "org.signal.Signal"
flatpak "org.videolan.VLC"
flatpak "org.wezfurlong.wezterm"
