# vim: set ft=ruby:
cask_args appdir: "~/Applications", require_sha: true
ENV["PATH"] = "#{HOMEBREW_PREFIX}/bin:#{ENV["PATH"]}"

# runtimes
brew "bash"
brew "golang"
brew "node@22"
brew "node@24", { link: true }
brew "php@8.4", { link: true }
brew "dotnet"

# package managers
brew "uv"
brew "pipx"

# lsp
brew "ansible-language-server"
brew "bash-language-server"
brew "dockerfile-language-server"
brew "lua-language-server"
brew "sql-language-server"
brew "typescript-language-server"
brew "yaml-language-server"
npm "vscode-langservers-extracted"
npm "intelephense"
npm "marksman"

# lint & format
brew "ansible-lint"
brew "yamllint"
npm "eslint_d"
npm "stylelint"
brew "phpstan"
brew "shellcheck"
brew "sqlfluff"
brew "yamllint"
brew "php-cs-fixer"
npm "@fsouza/prettierd"
brew "stylua"
brew "taplo"
brew "yamlfmt"

# tools
brew "ankitpokhrel/jira-cli/jira-cli"
brew "ansible"
brew "antidote"
brew "arl/arl/gitmux"
brew "aws-vault"
brew "awscli"
brew "bat"
brew "bottom"
brew "btop"
brew "cmake"
brew "cmatrix"
brew "coreutils"
brew "cowsay"
brew "crane"
brew "curl"
brew "difftastic"
brew "direnv"
brew "docker-compose"
brew "docker-credential-helper"
brew "duf"
brew "entr"
brew "esphome"
brew "exiftool"
brew "eza"
brew "fastfetch"
brew "figlet"
brew "fx"
brew "fzf"
brew "gd"
brew "gh"
brew "git"
brew "git-delta"
brew "git-extras"
brew "git-lfs"
brew "glow"
brew "gnupg"
brew "gnutls"
brew "htop"
brew "jq"
brew "just"
brew "lazygit"
brew "litecli"
brew "lolcat"
brew "mariadb"
brew "mycli"
brew "ncdu"
brew "neovim"
brew "nmap"
brew "noti"
brew "nyancat"
brew "opencode"
brew "openssh"
brew "pgcli"
brew "podman"
brew "pre-commit"
brew "prettyping"
brew "procs"
brew "pv"
brew "qrencode"
brew "ripgrep"
brew "sesh"
brew "starship"
brew "stow"
brew "syncthing"
brew "tlrc"
brew "tmux"
brew "topgrade"
brew "tree"
brew "tree-sitter-cli"
brew "tty-clock"
brew "watch"
brew "wget"
brew "yq"
brew "zoxide"
brew "zsh"
cask "font-fira-code-nerd-font"

# Apps

if OS.mac?
  brew "m-cli"
  brew "mas"
  cask "aws-vpn-client"
  cask "bitwarden"
  cask "bluesnooze"
  cask "claude"
  cask "claude-code"
  cask "firefox"
  cask "jellyfin-media-player"
  cask "keepingyouawake"
  cask "localsend"
  cask "multiviewer"
  cask "obsidian"
  cask "ollama-app"
  cask "openscad"
  cask "podman-desktop"
  cask "powershell"
  cask "rectangle"
  cask "rustdesk"
  cask "scroll-reverser"
  cask "signal"
  cask "slack"
  cask "spotify"
  cask "tailscale-app"
  cask "utm"
  cask "vlc"
  cask "wezterm"
end

if OS.linux?
  brew "ollama", { restart_service: :changed, start_service: true }
  flatpak "com.bitwarden.desktop"
  flatpak "com.github.tchx84.Flatseal"
  flatpak "com.rustdesk.RustDesk"
  flatpak "com.spotify.Client"
  flatpak "com.usebottles.bottles"
  flatpak "com.valvesoftware.Steam"
  flatpak "io.missioncenter.MissionCenter"
  flatpak "io.podman_desktop.PodmanDesktop"
  flatpak "it.mijorus.smile"
  flatpak "md.obsidian.Obsidian"
  flatpak "net.davidotek.pupgui2"
  flatpak "org.jellyfin.JellyfinDesktop"
  flatpak "org.kde.gwenview"
  flatpak "org.kde.isoimagewriter"
  flatpak "org.libreoffice.LibreOffice"
  flatpak "org.localsend.localsend_app"
  flatpak "org.mozilla.firefox"
  flatpak "org.openscad.OpenSCAD"
  flatpak "org.signal.Signal"
  flatpak "org.videolan.VLC"
  flatpak "org.videolan.vlc"
  flatpak "org.wezfurlong.wezterm"
end
