# vim: set ft=ruby:
cask_args appdir: "~/Applications", require_sha: true

brew "ankitpokhrel/jira-cli/jira-cli"
brew "ansible"
brew "ansible-lint"
brew "antidote"
brew "arl/arl/gitmux"
brew "asdf"
brew "aws-vault"
brew "awscli"
brew "bash"
brew "bat"
brew "bottom"
brew "btop"
brew "cmake"
brew "cmatrix"
brew "coreutils"
brew "cowsay"
brew "crane"
brew "curl"
brew "difftastic"
brew "direnv"
brew "docker-compose"
brew "docker-credential-helper"
brew "dotnet"
brew "duf"
brew "entr"
brew "esphome"
brew "exiftool"
brew "eza"
brew "fastfetch"
brew "figlet"
brew "fx"
brew "fzf"
brew "gd"
brew "gh"
brew "git"
brew "git-absorb"
brew "git-delta"
brew "git-extras"
brew "git-lfs"
brew "glow"
brew "gnupg"
brew "gnutls"
brew "go-task"
brew "gum"
brew "helm"
brew "htop"
brew "httpie"
brew "hugo"
brew "hurl"
brew "jq"
brew "k9s"
brew "kustomize"
brew "lazydocker"
brew "lazygit"
brew "litecli"
brew "lolcat"
brew "mariadb"
brew "marp-cli"
brew "minijinja-cli"
brew "mycli"
brew "ncdu"
brew "neovim"
brew "nmap"
brew "noti"
brew "nyancat"
brew "openssh"
brew "pgcli"
brew "php@8.4", { link: true }
brew "pipx"
brew "podman"
brew "prettyping"
brew "procs"
brew "pssh"
brew "pv"
brew "qrencode"
brew "ripgrep"
brew "sesh"
brew "speedtest-cli"
brew "spotify_player"
brew "starship"
brew "stow"
brew "tlrc"
brew "tmux"
brew "tmuxinator"
brew "topgrade"
brew "tree"
brew "tty-clock"
brew "utkuozdemir/pv-migrate/pv-migrate"
brew "uv"
brew "virtctl"
brew "watch"
brew "wget"
brew "wireguard-tools"
brew "xdg-ninja"
brew "yazi"
brew "yq"
brew "zoxide"
brew "zsh"
cask "font-fira-code-nerd-font"

if OS.mac?
  brew "m-cli"
  brew "mas"
  cask "aws-vpn-client"
  cask "bitwarden"
  cask "bluesnooze"
  cask "claude"
  cask "firefox"
  cask "jellyfin-media-player"
  cask "keepingyouawake"
  cask "localsend"
  cask "multiviewer"
  cask "obsidian"
  cask "ollama-app"
  cask "openscad@snapshot"
  cask "podman-desktop"
  cask "powershell"
  cask "rectangle"
  cask "rustdesk"
  cask "scroll-reverser"
  cask "signal"
  cask "slack"
  cask "spotify"
  cask "tailscale-app"
  cask "utm"
  cask "vlc"
  cask "wezterm"
end

if OS.linux?
  brew "ollama", { restart_service: :changed, start_service: true }
  flatpak "com.bitwarden.desktop"
  flatpak "com.fastmail.Fastmail"
  flatpak "com.rustdesk.RustDesk"
  flatpak "com.spotify.Client"
  flatpak "com.usebottles.bottles"
  flatpak "io.podman_desktop.PodmanDesktop"
  flatpak "it.mijorus.smile"
  flatpak "md.obsidian.Obsidian"
  flatpak "org.jellyfin.JellyfinDesktop"
  flatpak "org.kde.gwenview"
  flatpak "org.kde.isoimagewriter"
  flatpak "org.libreoffice.LibreOffice"
  flatpak "org.localsend.localsend_app"
  flatpak "org.mozilla.firefox"
  flatpak "org.openscad.OpenSCAD"
  flatpak "org.signal.Signal"
  flatpak "org.videolan.VLC"
  flatpak "org.wezfurlong.wezterm"
end
