jorgebucaran/fisher
oh-my-fish/plugin-brew
jorgebucaran/autopair.fish
evanlucas/fish-kubectl-completions
patrickf1/fzf.fish
jorgebucaran/fish-nvm
laughedelic/brew-completions
acomagu/fish-async-prompt
franciscolourenco/done
jhillyerd/plugin-git
danhper/fish-ssh-agent
oh-my-fish/plugin-tmux
jethrokuan/z
