jorgebucaran/fisher
oh-my-fish/plugin-brew
jorgebucaran/autopair.fish
evanlucas/fish-kubectl-completions
patrickf1/fzf.fish
laughedelic/brew-completions
acomagu/fish-async-prompt
franciscolourenco/done
jhillyerd/plugin-git
danhper/fish-ssh-agent
oh-my-fish/plugin-tmux
jethrokuan/z
nickeb96/puffer-fish
decors/fish-colored-man
edheltzel/fisher-plugin-macos
gazorby/fish-abbreviation-tips
oh-my-fish/plugin-config
oh-my-fish/plugin-weather
oh-my-fish/plugin-foreign-env
edc/bass
